#  Задайте число. Составьте список чисел Фибоначчи, в том числе
#  для отрицательных индексов.
#  Пример: для k = 8 список будет выглядеть так:
#  [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

k = int(input('Введите число: '))
fb = []
nfb = []

for i in range(k+1):
    if i == 0:
        fb.append(0)
    elif i == 1:
        fb.append(1)
    else:
        fb.append(fb[i - 1] + fb[i - 2])

for i in range(k, 0, -1):
    nfb.append(((-1) ** (i + 1)) * fb[i])

print(f'Список чисел Фиббоначи для ', k, ':', (nfb + fb))    