#  Задайте список из n чисел последовательности
#  (1 + 1 / n) ** n и выведите на экран их сумму.
#  Пример:
#  1 -> 2.0
#  2 -> 4.25
#  3 -> 6.62037037037037

n = int(input("Введите n: "))
array = list(range (1, n + 1))

summa = 0
for i in range(1, n + 1):
    sequence = (1 + 1 / i) ** i
    summa = summa + sequence
    print("Сумма чисел последовательности равна: ", summa)