#  Напишите программу, которая принимает на вход число N и выдает
#  набор произведений чисел от 1 до N.
#  Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

N = int(input("Введите целое: "))
int_array = list(range(1, N+1))

print("Произведение цифр равно: ")

i = 0
while (i != N-1):
    int_array[i+1] = int_array[i] * int_array[i+1]
    i = i + 1

print(list(int_array))